In [5]:
import pandas as pd
import numpy as np

In [48]:
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
df

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [44]:
def excel_one_line_to_list(df, col):
    df = df[col]
    df_li = df.values.tolist()
    result = []
    for s_li in df_li:
        result.append(s_li)
    print(result)
    return result

In [45]:
x = excel_one_line_to_list(df, 'A')
x

['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo']

['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo']

In [50]:
df.replace(x[:2], ['h']*2)

     A      B  C   D
0    h    one  0   0
1  bar    one  1   2
2    h    two  2   4
3  bar  three  3   6
4    h    two  4   8
5  bar    two  5  10
6    h    one  6  12
7    h  three  7  14